In [1]:
import pandas as pd
import numpy as np

In [2]:
# Dependencies and Setup


# File to Load (Remember to Change These)
school_data = "04-Pandas/Instructions/PyCitySchools/Resources/schools_complete.csv"
student_data = "04-Pandas/Instructions/PyCitySchools/Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas Data Frames
school_data = pd.read_csv(school_data)
student_data = pd.read_csv(student_data)

# Combine the data into a single dataset
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])
#school_data_complete.head()

In [3]:
total_budget = school_data['budget'].sum()
#total_budget

In [4]:
total_students = student_data["Student ID"].count()
#total_students

In [5]:
total_schools = school_data['type'].count()
#total_schools

In [6]:
mean_math_score = student_data['math_score'].mean()
#mean_math_score

In [7]:
mean_reading_score = student_data['reading_score'].mean()
#mean_reading_score

In [8]:
math_score = school_data_complete[school_data_complete.math_score >= 70]
math_pass = math_score["math_score"].count()

In [9]:
reading_score = school_data_complete[school_data_complete.reading_score >= 70]
reading_pass = reading_score["reading_score"].count()

In [10]:
total_students = student_data["Student ID"].count()

In [11]:
reading_passr = ((reading_pass / total_students))
#reading_pass_r = reading_passr.round(8)
#reading_pass_r

In [12]:
math_passr = ((math_pass / total_students))
#math_pass_r = math_passr.round(8)
#math_pass_r

In [13]:
overall_passr = ((mean_reading_score + mean_math_score) / 2) 
#overall_passr
# this is not what you asked for by defintion or meaningful in any way

In [14]:
sh = [(school_data_complete["math_score"] >= 70) & (school_data_complete["reading_score"] >= 70)]
#sh

In [15]:
sh1 = sum(sh)
right_an = sum(((sh1)/ total_students)*100)
right_an
#this is the overall pass rate of both exams

65.17232575947607

In [16]:
data = [{'Total Budget' : total_budget, 'Total Students' : total_students , 'Total Schools' : total_schools, 'Avg. Math Score' : mean_math_score, 'Avg Reading Score' : mean_reading_score, '% Overall Passed' : overall_passr, '% Math Passed' : math_passr, '% Reading Passed' : reading_passr}]

In [17]:
summary_df = pd.DataFrame(data)
summary_df

,% Math Passed,% Overall Passed,% Reading Passed,Avg Reading Score,Avg. Math Score,Total Budget,Total Schools,Total Students
0,0.749809,80.431606,0.858055,81.87784,78.985371,24649428,15,39170

In [18]:
#school_data_complete.columns

In [19]:
new_df = school_data_complete.copy(deep = True)

In [20]:
#new_df.columns

In [21]:
mPass = new_df.loc[new_df["math_score"] >= 70]
n_df = mPass.groupby("school_name")
x_df = n_df["school_name"].count()

In [22]:
#x_df.head()

In [23]:
rPass = new_df.loc[new_df["reading_score"] >= 70]
m_df = rPass.groupby("school_name")
y_df = m_df["school_name"].count()

In [24]:
#y_df

In [25]:
school_summary= school_data_complete[['school_name', 'type', 'size', 'budget']]
school_group = school_summary.groupby(['school_name']).first()

school_summary2 = school_data_complete[['school_name', 'reading_score']]
school_group2 = school_summary2.groupby(['school_name'])
school_comparison = school_group2.mean()

school_group['Average Reading Score'] = school_comparison['reading_score']
#school_group

In [26]:
school_summary3 = school_data_complete[['school_name', 'math_score']]
school_group3 = school_summary3.groupby(['school_name'])
school_comparison2 = school_group3.mean()
school_group['Average Math Score'] = school_comparison2['math_score']
#school_group

In [27]:
school_group['Budget Per Student'] = school_group['budget'] / school_group['size']
#school_comparison

In [28]:
school_group['reading_pass'] = y_df
#school_comparison

In [29]:
school_group['math_pass'] = x_df
#school_comparison

In [30]:
school_group['Math Passing %'] = (school_group['math_pass'] / school_group['size'] * 100)
#school_comparison

In [31]:
school_group['Reading Passing %'] = (school_group['reading_pass'] / school_group['size'] * 100)
#school_comparison

In [32]:
school_group["Overall Pass %"] = (school_group["Average Reading Score"] + school_group["Average Math Score"]) / 2

In [33]:
final_df = school_group.drop(['reading_pass', 'math_pass'], axis = 1)
Top_df = final_df.sort_values(by = "Overall Pass %", axis = 0, ascending = False, inplace = False)
Top_df.head(5)

,type,size,budget,Average Reading Score,Average Math Score,Budget Per Student,Math Passing %,Reading Passing %,Overall Pass %
school_name,,,,,,,,,
Pena High School,Charter,962,585858,84.044699,83.839917,609.0,94.594595,95.945946,83.942308
Wright High School,Charter,1800,1049400,83.955000,83.682222,583.0,93.333333,96.611111,83.818611
Holden High School,Charter,427,248087,83.814988,83.803279,581.0,92.505855,96.252927,83.809133
Thomas High School,Charter,1635,1043130,83.848930,83.418349,638.0,93.272171,97.308869,83.633639
Wilson High School,Charter,2283,1319574,83.989488,83.274201,578.0,93.867718,96.539641,83.631844

In [34]:
Bottom_df = final_df.sort_values(by = "Overall Pass %", axis = 0, ascending = True, inplace = False)
Bottom_df.head(5)

,type,size,budget,Average Reading Score,Average Math Score,Budget Per Student,Math Passing %,Reading Passing %,Overall Pass %
school_name,,,,,,,,,
Rodriguez High School,District,3999,2547363,80.744686,76.842711,637.0,66.366592,80.220055,78.793698
Huang High School,District,2917,1910635,81.182722,76.629414,655.0,65.683922,81.316421,78.906068
Ford High School,District,2739,1763916,80.746258,77.102592,644.0,68.309602,79.299014,78.924425
Figueroa High School,District,2949,1884411,81.158020,76.711767,639.0,65.988471,80.739234,78.934893
Johnson High School,District,4761,3094650,80.966394,77.072464,650.0,66.057551,81.222432,79.019429

In [35]:
f_df = school_data_complete[school_data_complete['grade']=='9th']
fresh_df= f_df.groupby('school_name')['math_score'].mean()
#fresh_df

In [36]:
sp_df = school_data_complete[school_data_complete['grade']=='10th']
soph_df = sp_df.groupby('school_name')['math_score'].mean()

In [37]:
j_df = school_data_complete[school_data_complete['grade']=='11th']
jun_df = j_df.groupby('school_name')['math_score'].mean()

In [38]:
s_df = school_data_complete[school_data_complete['grade']=='12th']
sen_df = s_df.groupby('school_name')['math_score'].mean()

In [39]:
data2 = {'9th' : fresh_df, '10th' : soph_df, '11th' : jun_df, '12th' : sen_df}

In [40]:
math_df = pd.DataFrame(data2)
math_df

                             9th       10th       11th       12th
school_name
Bailey High School     77.083676  76.996772  77.515588  76.492218
Cabrera High School    83.094697  83.154506  82.765560  83.277487
Figueroa High School   76.403037  76.539974  76.884344  77.151369
Ford High School       77.361345  77.672316  76.918058  76.179963
Griffin High School    82.044010  84.229064  83.842105  83.356164
Hernandez High School  77.438495  77.337408  77.136029  77.186567
Holden High School     83.787402  83.429825  85.000000  82.855422
Huang High School      77.027251  75.908735  76.446602  77.225641
Johnson High School    77.187857  76.691117  77.491653  76.863248
Pena High School       83.625455  83.372000  84.328125  84.121547
Rodriguez High School  76.859966  76.612500  76.395626  77.690748
Shelton High School    83.420755  82.917411  83.383495  83.778976
Thomas High School     83.590022  83.087886  83.498795  83.497041
Wilson High School     83.085578  83.724422  83.195326  83.035794
Wright High School     83.264706  84.010288  83.836782  83.644986

In [41]:
f_df2 = school_data_complete[school_data_complete['grade']=='9th']
fresh_df2= f_df2.groupby('school_name')['reading_score'].mean()

In [42]:
sp_df2 = school_data_complete[school_data_complete['grade']=='10th']
soph_df2 = sp_df2.groupby('school_name')['reading_score'].mean()

In [43]:
j_df2 = school_data_complete[school_data_complete['grade']=='11th']
jun_df2 = j_df2.groupby('school_name')['reading_score'].mean()

In [44]:
s_df2 = school_data_complete[school_data_complete['grade']=='12th']
sen_df2 = s_df2.groupby('school_name')['reading_score'].mean()

In [45]:
data3 = {'9th' : fresh_df2, '10th' : soph_df2, '11th' : jun_df2, '12th' : sen_df2}

In [46]:
reading_df = pd.DataFrame(data3)
reading_df

                             9th       10th       11th       12th
school_name
Bailey High School     81.303155  80.907183  80.945643  80.912451
Cabrera High School    83.676136  84.253219  83.788382  84.287958
Figueroa High School   81.198598  81.408912  80.640339  81.384863
Ford High School       80.632653  81.262712  80.403642  80.662338
Griffin High School    83.369193  83.706897  84.288089  84.013699
Hernandez High School  80.866860  80.660147  81.396140  80.857143
Holden High School     83.677165  83.324561  83.815534  84.698795
Huang High School      81.290284  81.512386  81.417476  80.305983
Johnson High School    81.260714  80.773431  80.616027  81.227564
Pena High School       83.807273  83.612000  84.335938  84.591160
Rodriguez High School  80.993127  80.629808  80.864811  80.376426
Shelton High School    84.122642  83.441964  84.373786  82.781671
Thomas High School     83.728850  84.254157  83.585542  83.831361
Wilson High School     83.939778  84.021452  83.764608  84.317673
Wright High School     83.833333  83.812757  84.156322  84.073171

In [47]:
Top_df.columns

Index(['type', 'size', 'budget', 'Average Reading Score', 'Average Math Score',
       'Budget Per Student', 'Math Passing %', 'Reading Passing %',
       'Overall Pass %'],
      dtype='object')

In [48]:
spending_df = Top_df.copy(deep = True)
#spending_df.columns
spending_df2 = spending_df.drop(['type', 'size', 'budget'], axis = 1)
#spending_df2

In [49]:
spending_ranges = [0, 585, 615, 645, 675]
group_names = ["<$585", "$585-615", "$615-645", "$645-675"]

In [50]:
spending_df2["Spending Ranges (Per Student)"] = pd.cut(spending_df2["Budget Per Student"], bins=spending_ranges, labels=group_names)
#spending_df2

In [51]:
spending_df2 = spending_df2.groupby("Spending Ranges (Per Student)")
spending_df3 = spending_df2.mean()
#spending_df3

In [52]:
spending_df4 = spending_df3.drop(['Budget Per Student'], axis = 1)

In [53]:
spending_df4

,Average Reading Score,Average Math Score,Math Passing %,Reading Passing %,Overall Pass %
Spending Ranges (Per Student),,,,,
<$585,83.933814,83.455399,93.460096,96.610877,83.694607
$585-615,83.885211,83.599686,94.230858,95.900287,83.742449
$615-645,81.891436,79.079225,75.668212,86.106569,80.485330
$645-675,81.027843,76.997210,66.164813,81.133951,79.012526

In [54]:
size_df = spending_df.drop(['type', 'Budget Per Student', 'budget'], axis = 1)

In [55]:
size_bins = [0, 1000, 2000, 5000]
group_names = ["Small (<1000)", "Medium (1000-2000)", "Large (2000-5000)"]

In [56]:
size_df["School Size"] = pd.cut(size_df["size"], bins=size_bins, labels=group_names)

In [57]:
size_df = size_df.groupby("School Size")
size_df2 = size_df.mean()
#size_df2
size_df3 = size_df2.drop(['size'], axis = 1)
size_df3

,Average Reading Score,Average Math Score,Math Passing %,Reading Passing %,Overall Pass %
School Size,,,,,
Small (<1000),83.929843,83.821598,93.550225,96.099437,83.875721
Medium (1000-2000),83.864438,83.374684,93.599695,96.790680,83.619561
Large (2000-5000),81.344493,77.746417,69.963361,82.766634,79.545455

In [58]:
type_df = spending_df.drop(['size', 'Budget Per Student', 'budget'], axis = 1)

In [59]:
type_df = type_df.groupby("type").mean()
type_df

,Average Reading Score,Average Math Score,Math Passing %,Reading Passing %,Overall Pass %
type,,,,,
Charter,83.896421,83.473852,93.620830,96.586489,83.685136
District,80.966636,76.956733,66.548453,80.799062,78.961685

In [60]:
#From the report I can say a couple of things
#smaller schools out preform larger schools in terms of performance
#budget per student inflates with school size
#Charter Schools outperform District Schools*
#Student performance is not highly variant Year over Year
#Reading performace is more stable than math performance
#Charter schools total grade distribution is smaller, the means are only slightly above district means but their pass rates far outperform the district rates.
#This indicates a tighter spread of grades within the charter schools
#Caveats: Overall Pass rate is calculated wrong so it throws a wrench in any analysis of overall pass rate, which is actually much lower
#The lack of a count of teachers per school prevents further discussion or analysis of core education problems
#economic and demographic data of each school would provide further room for analysis
#*charters class sizes probably have something to do with the raised performance